# ============================================================================
# Brewfile - Vaibhav Singh
# Install: brew bundle --file=Brewfile
# ============================================================================

# Taps
tap "homebrew/bundle"
tap "homebrew/services"

# ============================================================================
# CLI Essentials (Modern replacements)
# ============================================================================
brew "eza"           # Modern ls replacement (icons, git-aware)
brew "bat"           # Modern cat with syntax highlighting
brew "ripgrep"       # Modern grep (rg) - blazing fast
brew "fd"            # Modern find - simpler syntax
brew "fzf"           # Fuzzy finder for everything
brew "zoxide"        # Smarter cd (z command)
brew "delta"         # Beautiful git diffs
brew "btop"          # Modern top/htop
brew "duf"           # Modern df (disk usage)
brew "dust"          # Modern du (disk space)
brew "gping"         # Ping with graph
brew "dog"           # Modern dig (DNS)
brew "curlie"        # Modern curl with httpie-like output
brew "tldr"          # Simplified man pages
brew "jq"            # JSON processor
brew "yq"            # YAML processor
brew "hyperfine"     # CLI benchmarking tool
brew "procs"         # Modern ps

# ============================================================================
# Development Tools
# ============================================================================
brew "git"
brew "git-lfs"
brew "tmux"
brew "tree"          # Directory tree view
brew "wget"
brew "httpie"        # Human-friendly HTTP client
brew "shellcheck"    # Shell script linter

# ============================================================================
# Languages & Runtime Managers
# ============================================================================
brew "asdf"

# ============================================================================
# Cloud & Infrastructure
# ============================================================================
brew "awscli"
brew "terraform"
brew "packer"
brew "kubectl"
brew "kubectx"       # Switch k8s contexts/namespaces
brew "helm"
brew "docker"
brew "docker-compose"
brew "lazydocker"    # TUI for Docker

# ============================================================================
# Database Tools
# ============================================================================
brew "mysql"
brew "redis"
brew "sqlite"

# ============================================================================
# Security
# ============================================================================
brew "gnupg"
brew "age"           # Modern encryption
brew "sops"          # Secret management
brew "trivy"         # Container vulnerability scanner

# ============================================================================
# GUI Applications
# ============================================================================
cask "ghostty"
cask "visual-studio-code"
cask "intellij-idea"
cask "docker"
cask "postman"
cask "google-chrome"
cask "slack"
cask "discord"
cask "notion"
cask "rectangle"     # Window management
